CFD Projects/Serpentine_cooling/serpentine_cooling/case_Re500/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  Serpentine Cooling Channel - fvSchemes
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
    grad(k)         cellLimited Gauss linear 1;
    grad(epsilon)   cellLimited Gauss linear 1;
}

divSchemes
{
    default             none;
    div(phi,U)          bounded Gauss linearUpwind grad(U);
    div(phi,T)          bounded Gauss linearUpwind default;
    div(phi,k)          bounded Gauss linearUpwind default;
    div(phi,epsilon)    bounded Gauss linearUpwind default;
    div(phi,K)          bounded Gauss linearUpwind default;
    div(phi,h)          bounded Gauss linearUpwind default;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh           ;
}
