CFD Projects/Serpentine_cooling/serpentine_cooling/case_Re500/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  Serpentine Cooling Channel - fvSolution
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|T|h|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

    "(U|T|h|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }
}

SIMPLE
{
    momentumPredictor   yes;
    nNonOrthogonalCorrectors 2;
    pRefCell            0;
    pRefValue           0;

    residualControl
    {
        p_rgh           1e-4;
        U               1e-4;
        T               1e-4;
        k               1e-4;
        epsilon         1e-4;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.3;
    }
    equations
    {
        U               0.7;
        T               0.7;
        h               0.7;
        k               0.5;
        epsilon         0.5;
    }
}
